# 3. Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов 
# исходной последовательности в том же порядке.
# in                             in                                            in
# 7                              -1                                            10
# out                            out                                           out
# [4, 5, 3, 3, 4, 1, 2]          Negative value of the number of numbers!      [4, 4, 5, 5, 6, 2, 3, 0, 9, 4]
# [5, 1, 2]                      []                                            [6, 2, 3, 0, 9]

